Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: Send tabs between devices, manage downloads, and get tips on getting the most out of %s.
am: በመሳሪያዎች መካከል ትሮችን ይላኩ፣ ውርዶችን ያስተዳድሩ እና %sን የበለጠ ለመጠቀም ምክሮችን ያግኙ።

source: Send technical and interaction data
am: ቴክኒካዊ እና መስተጋብር ውሂብ ላክ

source: Send technical and interaction data to Mozilla
am: ቴክኒካዊ እና መስተጋብር ውሂብ ወደ Mozilla ይላኩ

source: Send to all devices
am: ወደ ሁሉም መሳሪያዎች ላክ

source: Send to device
am: ወደ መሳሪያ ላክ

source: Sep
am: መስ

source: Sepia
am: ቀላ ያለ ቡናማ

source: Sepia color scheme
am: ቀላ ያለ ቡናማ ቀለም ንድፍ

source: Serif
am: ሰሪፍ

source: Serif font
am: ሰሪፍ ቅርጸ-ቁምፊ

source: Set
am: አቀናብር

source: Set as default browser
am: ነባሪ አሳሽ አድርገህ አስቀምጥ

source: Set by Battery Saver
am: በባትሪ ቆጣቢ የተዘጋጀ

source: Set links from websites, emails, and messages to open automatically in Firefox.
am: በፋየርፎክስ ውስጥ በራስ-ሰር የሚከፈቱ ከድረ-ገፆች፣ ኢሜይሎች እና መልዕክቶች አገናኞችን ያዘጋጁ።

source: Set open tabs to close automatically that haven’t been viewed in the past day, week, or month.
am: ባለፈው ቀን፣ ሳምንት ወይም ወር ውስጥ ያልታዩ ክፍት ትሮችን በራስ ሰር እንዲዘጋ ያቀናብሩ።

source: Set time
am: ስዓት ይሙሉ

source: Set up a device lock pattern, PIN, or password to protect your saved credit cards from being accessed if someone else has your device.
am: የተቀመጡ ክሬዲት ካርዶችዎን ሌላ ሰው የእርስዎን መሣሪያ በመጠቀም እንዳይደረስበት ለመከላከል የመሣሪያ መቆለፊያ ስርዓተ ጥለትን፣ ፒን ወይም የይለፍ ቃል ያዘጋጁ።

source: Set up a device lock pattern, PIN, or password to protect your saved logins and passwords from being accessed if someone else has your device.
am: የተቀመጡ መግቢያዎችዎን እና የይለፍ ቃላትዎን ሌላ ሰው የእርስዎን መሣሪያ በመጠቀም እንዳይደረስበት ለመከላከል የመሣሪያ መቆለፊያ ስርዓተ ጥለትን፣ ፒን ወይም የይለፍ ቃል ያዘጋጁ።

source: Set up a device lock pattern, PIN, or password to protect your saved passwords from being accessed if someone else has your device.
am: ሌላ ሰው የእርስዎ መሣሪያ ካለው ፤ የተቀመጡ የይለፍ ቃላትዎን እንዳይደረስበት ለመከላከል የመሣሪያ መቆለፊያ ስርዓተ-ጥለት፣ ፒን ወይም የይለፍ ቃል ያዘጋጁ።

source: Set up a device lock pattern, PIN, or password to protect your saved payment methods from being accessed if someone else has your device.
am: ሌላ ሰው የእርስዎ መሣሪያ ካለው ፤ የተቀመጡ የመክፈያ ዘዴዎችዎን እንዳይደረስበት ለመከላከል የመሣሪያ መቆለፊያ ስርዓተ-ጥለት፣ ፒን ወይም የይለፍ ቃል ያዘጋጁ።

source: Set up now
am: አሁን አዋቅር

source: Set up screen lock to hide tabs
am: ትሮችን ለመደበቅ የማያ ገጽ መቆለፊያን ያዘጋጁ

source: %s had to restart
am: %s እንደገና መጀመር ነበረበት

source: Share…
am: ያጋሩ…

source: Share all tabs
am: ሁሉንም ትሮች ያጋሩ

source: Share authentication information with extension developer
am: የማረጋገጫ መረጃን ከቅጥያ ገንቢ ጋር ያጋሩ

source: Share bookmarks information with extension developer
am: የዕልባቶች መረጃ ከቅጥያ ገንቢ ጋር ያጋሩ

source: Share browsing activity with extension developer
am: የአሰሳ እንቅስቃሴን ከቅጥያ ገንቢ ጋር ያጋሩ

source: Share email address
am: የኢሜይል አድራሻ አጋራ

source: Share file
am: ፋይል አጋራ

source: Share financial and payment information with extension developer
am: የፋይናንስ እና የክፍያ መረጃን ከቅጥያ ገንቢ ጋር ያጋሩ

source: Share health information with extension developer
am: የጤና መረጃን ከቅጥያ ገንቢ ጋር ያጋሩ

source: Share how you discovered Firefox, and that you use it, with Mozilla’s marketing partners. This data is never sold.
am: Firfoxን እንዴት እንዳገኙት እና እንደሚጠቀሙበት ከMozilla የግብይት አጋሮች ጋር ያጋሩ። ይህ ውሂብ በጭራሽ አይሸጥም።

source: Share how you discovered Firefox and that you use it with Mozilla’s marketing technology partners.
am: ፋየርፎክስን እንዴት እንዳገኘህ እና ከሞዚላ የግብይት ቴክኖሎጂ አጋሮች ጋር እንደምትጠቀምበት አጋራ።

source: Share image
am: ምስል አጋራ

source: Share information about how you discovered Firefox with Mozilla’s marketing partners. This helps us grow Firefox and build a better internet
am: ፋየርፎክስን እንዴት እንዳገኙት ከሞዚላ የግብይት አጋሮች ጋር ያካፍሉ። ይህ ፋየርፎክስን እንድናሳድግ እና የተሻለ አውታረ መረብ እንድንገነባ ይረዳናል

source: Share link
am: አገናኝ አጋራ

source: Share location information with extension developer
am: የአካባቢ መረጃን ከቅጥያ ገንቢ ጋር ያጋሩ

source: Share minimal data with Mozilla’s marketing technology partners. This data is never sold or used to show you ads.
am: አነስተኛውን ውሂብ ከሞዚላ የግብይት ቴክኖሎጂ አጋሮች ጋር ያጋሩ። ይህ ውሂብ በጭራሽ አይሸጥም ወይም ማስታወቂያዎችን ለእርስዎ ለማሳየት ጥቅም ላይ አይውልም።

source: Share personal communications with extension developer
am: የግል ግንኙነቶችን ከቅጥያ ገንቢ ጋር ያጋሩ

source: Share personally identifying information with extension developer
am: የግል መለያ መረጃን ከቅጥያ ገንቢ ጋር ያጋሩ

source: Shares basic usage data with Adjust, our mobile marketing vendor
am: የሞባይል ግብይት አቅራቢያችን ከሆነው ከአጀስት ጋር መሰረታዊ የአጠቃቀም መረጃን ያካፍላል

source: Shares crash data automatically on startup with Mozilla after crashes occur
am: ብልሽቶች ከተከሰቱ በኋላ ከMozilla መጀመር ጋር የብልሽት ውሂብን በራስ-ሰር ያጋራል

source: Share search terms with extension developer
am: የፍለጋ ቃላትን ከቅጥያ ገንቢ ጋር ያጋሩ

source: Share selected tabs
am: የተመረጡ ትሮችን ያጋሩ

source: Shares performance, usage, hardware and customization data about your browser with Mozilla to help us make %1$s better
am: %1$s የተሻለ ለማድረግ እንዲረዳን የአሳሽዎን የአፈጻጸም፣ የአጠቃቀም፣ የሃርድዌር እና የማበጀት ውሂብ ለሞዚላ ያጋራል

source: Share technical and interaction data with extension developer
am: ቴክኒካዊ እና የመስተጋብር ውሂብን ከቅጥያ ገንቢ ጋር ያጋሩ

source: Share URL
am: URL አጋራ

source: Share via
am: በ በኩል አጋራ

source: Share website activity with extension developer
am: የድር ጣቢያ እንቅስቃሴን ከቅጥያ ገንቢ ጋር ያጋሩ

source: Share website content with extension developer
am: የድር ጣቢያ ይዘትን ከቅጥያ ገንቢ ጋር ያጋሩ

source: Share with…
am: ያጋሩ ከ…

source: %s, Heading
am: %s፣ ርዕስ

source: Shipping
am: ማጓጓዣ

source: Shortcut limit reached
am: የአቋራጭ ገደብ ላይ ደርሷል

source: Shortcut name
am: የአቋራጭ ስም

source: Shortcut URL
am: የአቋራጭ URL

source: Show ads in review checker
am: በግምገማ አረጋጋጭ ውስጥ ማስታወቂያዎችን አሳይ

source: Show all
am: ሁሉንም አሳይ

source: Show all bookmarks
am: ሁሉንም እልባቶች አሳይ

source: Show all past explorations
am: ሁሉንም ያለፉ አሰሳዎችን አሳይ

source: Show all recent tabs button
am: ሁሉንም የቅርብ ጊዜ ትሮች ቁልፍ አሳይ

source: Show all saved bookmarks
am: ሁሉንም የተቀመጡ እልባቶችን አሳይ

source: Show all sites
am: ሁሉንም ጣቢያዎች አሳይ

source: Show clipboard suggestions
am: የቅንጥብ ሰሌዳ ጥቆማዎችን አሳይ

source: Show fewer sites
am: ያነሱ ጣቢያዎችን አሳይ

source: Show full history
am: ሙሉ ታሪክ አሳይ

source: Show hidden text
am: የተደበቀ ጽሑፍ አሳይ

source: Show in private sessions
am: በግል ክፍለ ጊዜዎች አሳይ

source: Show less
am: ያነሰ አሳይ

source: Show more
am: ተጨማሪ አሳይ

source: Show original
am: ዋናውን አሳይ

source: Show password
am: የይለፍ ቃል አሳይ

source: Show recent searches
am: የቅርብ ጊዜ ፍለጋዎችን አሳይ

source: Show search engines
am: የፍለጋ ፍርግሞችን አሳይ

source: Show search suggestions
am: የፍለጋ ጥቆማዎችን አሳይ

source: Show shortcuts
am: አቋራጮችን አሳይ

source: Show trending suggestions
am: በመታየት ላይ ያሉ ጥቆማዎችን አሳይ

source: Show voice search
am: የድምጽ ፍለጋ አሳይ

source: Sign back in to sync
am: ለማመሳሰል ተመልሰው ይግቡ

source: Sign in
am: ይግቡ

source: Sign-in or sign-out
am: መግባት ወይም መውጣት

source: Sign in to reconnect
am: ዳግም ለመገናኘት ይግቡ

source: Sign in to see synced bookmarks
am: የተመሳሰሉ እልባቶችን ለማየት ይግቡ

source: Sign in to sync
am: ለማመሳሰል ይግቡ

source: Sign in to Sync
am: ለማመሳሰል ይግቡ

source: Sign in to sync tabs, bookmarks, passwords, and more.
am: ትሮችን፣ እልባቶችን፣ የይለፍ ቃላትን እና ሌሎችን ለማመሳሰል ይግቡ።

source: Sign in to your account
am: ወደ መለያዎ ይግቡ

source: Sign in with a %1$s account
am: በ%1$s መለያ ይግቡ

source: Sign in with your camera
am: በካሜራዎ ይግቡ

source: Sign out
am: ዘግተህ ውጣ

source: Simple
am: ቀላል

source: %s is off-duty. We suggest turning protections back on.
am: %s ከስራ ውጪ ነው። ጥበቃዎችን መልሰው እንዲያበሩ እንጠቁማለን።

source: %s is on guard
am: %s ጥበቃ ላይ ነው

source: Site
am: ድረ-ገፅ

source: Site asked to turn off ad blocker
am: ጣቢያ የማስታወቂያ ማገጃውን እንዲያጠፋ ተጠይቋል

source: Site currently not supported
am: በአሁኑ ጊዜ የማይደገፍ ድረ-ገፅ

source: Site doesn’t load
am: ጣቢያ አይክፍትም

source: Site information
am: የድረ-ገፅ መረጃ

source: Site is slow
am: ጣቢያው ቀርፋፋ ነው

source: Site notifications
am: የድረ-ገፅ ማሳወቂያዎች

source: Site not supported
am: ጣቢያው አይደገፍም

source: Site permissions
am: የድረ-ገፅ ፈቃዶች

source: Site removed
am: ድረ-ገፅ ተወግዷል

source: Site settings
am: የጣቢያ ቅንብሮች

source: Site slow or not working
am: ጣቢያ ቀርፋፋ ወይም አይሰራም

source: Social Media Trackers
am: ማህበራዊ ሚዲያ መከታተያዎች

source: Solid colors
am: ድፍን ቀለሞች

source: Some content has been blocked by the autoplay setting
am: አንዳንድ ይዘቶች በራስ አጫውት ቅንብር ታግደዋል

source: Some settings are temporarily unavailable.
am: አንዳንድ ቅንብሮች ለጊዜው አይገኙም።

source: Something else
am: ሌላ ነገር

source: Some trackers marked below have been partially unblocked on this page because you interacted with them *.
am: ከዚህ በታች ምልክት የተደረገባቸው አንዳንድ መከታተያዎች በዚህ ገጽ ላይ እገዳው በከፊል ተነስቷል ምክንያቱም ከእነሱ ጋር ስለተገናኙ *።

source: Sorry. %1$s can’t load that page.
am: አዝናለሁ። %1$s ያንን ገጽ መጫን አይችልም።

source: Sorry. %1$s had a problem and crashed.
am: አዝናለሁ። %1$s ችግር ነበረበት እና ተሰናክሏል።

source: Sorry. A problem occurred in %1$s.
am: አዝናለሁ። በ%1$s ውስጥ ችግር ተፈጥሯል።

source: Sorry, we don’t support %1$s yet.
am: ይቅርታ፣ እስካሁን %1$sን አንደግፍም።

source: Sort by A to Z
am: ከ A ወደ Z ደርድር

source: Sort by custom order
am: በብጁ ትዕዛዝ ደርድር

source: Sort by newest
am: በአዲሱ ደርድር

source: Sort by oldest
am: በቆየው ደርድር

source: Sort by Z to A
am: ከ Z ወደ A ደርድር

source: Sort logins menu
am: የመግቢያ ምናሌን ደርድር

source: Sort passwords menu
am: የይለፍ ቃላት ምናሌን ደርድር

source: %s | OSS Libraries
am: %s | ክፍት ምንጭ ሶፍትዌር (OSS) ጥቅሎች

source: Sponsored
am: ስፖንሰር የተደረገ

source: Sponsored shortcuts
am: ስፖንሰር የተደረጉ አቋራጮች

source: Sponsored stories
am: ስፖንሰር የተደረጉ ታሪኮች

source: %s (Private)
am: %s (የግል)

source: %s protects you from many of the most common trackers that follow what you do online.
am: %s በመስመር ላይ የሚያደርጉትን ከሚከተሉ ብዙ በጣም የተለመዱ መከታተያዎች ይጠብቅዎታል።

source: %s search
am: %s ፍለጋ

source: %s search engine
am: %s የፍለጋ ፍርግም

source: %s: search engine selector
am: %s፡ የፍለጋ ፍርግም መራጭ

source: Standard
am: ደረጃ

source: Standard (default)
am: መደበኛ (ነባሪ)

source: Start a quick search
am: ፈጣን ፍለጋ ይጀምሩ

source: Start browsing
am: ማሰስ ይጀምሩ

source: Start browsing.
am: ማሰስ ጀምር።

source: Start your first search
am: የመጀመሪያ ፍለጋዎን ይጀምሩ

source: State
am: ክልል

source: Status:
am: ሁኔታ፡-

source: Stay
am: ቆይ

source: Stay encrypted when you hop between devices
am: በመሳሪያዎች መካከል ሲዘጉ እንደተመሰጠሩ ይቆዩ

source: Stay in private browsing
am: በግል አሰሳ ውስጥ ይቆዩ

source: Stop
am: አቁም

source: Stop downloading %1$s (%2$s)
am: %1$s (%2$s) ማውረድ አቁም

source: Stops outside ads, videos, and other content from loading that contains tracking code. May affect some website functionality.
am: ከማስታወቂያዎች፣ ቪዲዮዎች እና ሌሎች የክትትል ኮድ የያዙ ሌሎች ይዘቶችን ከመጫን ያቆማል። አንዳንድ የድረ-ገጽ ተግባራትን ሊጎዳ ይችላል።

source: Stops uniquely identifiable data from being collected about your device that can be used for tracking purposes.
am: ለክትትል ዓላማዎች የሚያገለግል በልዩ ሁኔታ የሚለይ ውሂብ ስለ መሳሪያዎ እንዳይሰበሰብ ያቆማል።

source: Store unlimited amount of client-side data
am: ያልተገደበ የተገልጋይ-ጎን ውሂብ ያከማቹ

source: Stories
am: ታሪኮች

source: Stories by topic
am: ታሪኮች በርዕስ

source: Street Address
am: የአድራሻ ጎዳና

source: Strict
am: ጥብቅ

source: Stronger tracking protection and faster performance, but some sites may not work properly.
am: ጠንካራ የመከታተያ ጥበቃ እና ፈጣን አፈጻጸም፣ ነገር ግን አንዳንድ ጣቢያዎች በትክክል ላይሰሩ ይችላሉ።

source: Studies
am: ጥናቶች

source: Successfully disabled %1$s
am: %1$s በተሳካ ሁኔታ ተሰናክሏል

source: Successfully enabled %1$s
am: %1$s በተሳካ ሁኔታ ነቅቷል

source: Successfully installed %1$s
am: %1$s በተሳካ ሁኔታ ተጭኗል

source: Successfully removed %1$s
am: %1$s በተሳካ ሁኔታ ተወግዷል

source: Successfully uninstalled %1$s
am: %1$s በተሳካ ሁኔታ ተራግፏል

source: Successfully updated
am: በተሳካ ሁኔታ ዘምኗል

source: Suggested logins
am: የተጠቆሙ መግቢያዎች

source: Suggestions from %1$s
am: ጥቆማዎች ከ%1$s

source: Suggestions from search engines
am: ከፍለጋ ፍርግሞች የቀረቡ ጥቆማዎች

source: Suggestions from sponsors
am: ከስፖንሰሮች የተሰጡ አስተያየቶች

source: Suggest strong password
am: ጠንካራ የይለፍ ቃል ጥቆማ

source: Sunrise
am: የፀሐይ መውጣት

source: Sunset
am: ጀንበር ስትጠልቅ

source: Support %1$s with occasional sponsored suggestions
am: አልፎ አልፎ በሚደገፉ የአስተያየት ጥቆማዎች %1$sን ይደግፉ

source: Supported add-ons checker
am: የሚደገፉ ተጨማሪዎች አረጋጋጭ

source: Support request sent
am: የድጋፍ ጥያቄው ተልኳል

source: Survey complete
am: የዳሰሳ ጥናት ተጠናቅቋል

source: Survey feature icon
am: የዳሰሳ ባህሪ አዶ

source: Suspected Fingerprinters
am: የተጠረጠሩ ጣት-አሻራ ሰብሳቢዎች

source: %s will delete the selected browsing data.
am: %s የተመረጠውን የአሰሳ ውሂብ ይሰርዛል።

source: %s will delete the selected items.
am: %s የተመረጡትን ነገሮች ይሰርዛል።

source: %s will share everything you type in the address bar with your default search engine.
am: %s በአድራሻ አሞሌው ላይ የሚተይቡትን ሁሉ ከነባሪ የፍለጋ ፍርግምዎ ጋር ያጋራል።

source: %s will stop syncing with your account, but won’t delete any of your browsing data on this device.
am: %s ከመለያዎ ጋር ማመሳሰል ያቆማል፣ ነገር ግን በዚህ መሳሪያ ላይ የትኛውንም የአሰሳ ውሂብዎን አይሰርዝም።

source: Swipe address bar sideways to switch tabs
am: ትሮችን ለመቀየር የአድራሻ አሞሌን ወደ ጎን ያንሸራትቱ

source: Swipe left or right to switch. Swipe left on your last tab to open a new tab.
am: ለመቀየር ወደ ግራ ወይም ቀኝ ያንሸራትቱ። አዲስ ትር ለመክፈት በመጨረሻው ትር ላይ ወደ ግራ ያንሸራትቱ።

source: Swipe the toolbar left or right to switch tabs.
am: ትሮችን ለመቀየር የመሳሪያ አሞሌውን ወደ ግራ ወይም ቀኝ ያንሸራትቱ።

source: Swipe the toolbar to switch tabs
am: ትሮችን ለመቀየር የመሳሪያ አሞሌውን ያንሸራትቱ

source: Swipe toolbar sideways to switch tabs
am: ትሮችን ለመቀየር የመሳሪያ አሞሌን ወደ ጎን ያንሸራትቱ

source: Swipe toolbar up to open tabs
am: ትሮችን ለመክፈት የመሳሪያ አሞሌን ወደ ላይ ያንሸራትቱ

source: Switch
am: ቀይር

source: Switching screens is easier than ever
am: ስክሪን መቀየር ከመቼውም ጊዜ በበለጠ ቀላል ነው

source: Switch to desktop site
am: ወደ ዴስክቶፕ ጣቢያ ቀይር

source: Switch to mobile site
am: ወደ ሞባይል ጣቢያ ቀይር

source: Switch to tab
am: ወደ ትር ቀይር

source: Switch your default browser
am: ነባሪ አሳሽዎን ይቀይሩ

source: %s won’t save passwords for sites listed here.
am: %s እዚህ ለተዘረዘሩት ጣቢያዎች የይለፍ ቃላትን አያስቀምጥም።

source: %s won’t save passwords for these sites.
am: %s ለእነዚህ ጣቢያዎች የይለፍ ቃላትን አያስቀምጥም።

source: Sync
am: አመሳስል

source: Sync and save data
am: አመሳስል እና ውሂብ አስቀምጥ

source: Sync and save your data
am: ያመሳስሉ እና ውሂብዎን ያስቀምጡ

source: Sync bookmarks, passwords, tabs, and more
am: ዕልባቶችን፣ የይለፍ ቃላትን፣ ትሮችን እና ሌሎችን አመሳስል

source: Sync cards
am: ካርዶችን ያመሳስሉ

source: Sync cards across devices
am: በመሳሪያዎች ላይ አሰናስል

source: Synced device
am: የተመሳሰለ መሣሪያ

source: Synced tabs
am: የተመሳሰሉ ትሮች

source: Synced Tabs Open: %1$s. Tap to switch tabs.
am: የተመሳሰሉ ትሮች ተከፍተዋል፡ %1$s። ትሮችን ለመቀየር መታ ያድርጉ።

source: Sync failed. Last success: %s
am: ማመሳሰል አልተሳካም። የመጨረሻው ስኬት፡- %s

source: Sync failed. Last synced: never
am: ማመሳሰል አልተሳካም። መጨረሻ የተመሳሰለው፡- በጭራሽ

source: Syncing…
am: በማመሳሰል ላይ…

source: Syncing paused
am: ማመሳሰል ባለበት ቆሟል

source: Sync is on
am: ማመሳሰል በርቷል

source: Sync logins
am: መግቢያዎችን ያመሳስሉ

source: Sync logins across devices
am: በመሳሪያዎች ላይ መግቢያዎችን ያመሳስሉ

source: Sync now
am: አሁን አመሳስል

source: Sync passwords
am: የይለፍ ቃሎችን አሰናስል

source: Sync passwords across devices
am: የይለፍ ቃሎችን በሁሉም መሳሪያዎች ላይ ያሰናስሉ

source: Sync passwords, bookmarks, and more
am: የይለፍ ቃላትን፣ ዕልባቶችን እና ሌሎችን አመሳስል

source: Sync passwords, tabs, and more
am: የይለፍ ቃላትን፣ ትሮችን እና ሌሎችን አመሳስል

source: Sync tabs and passwords across devices for seamless screen-switching.
am: እንከን የለሽ ስክሪን ለመቀያየር ትሮችን እና የይለፍ ቃሎችን በመሳሪያዎች ላይ ያመሳስሉ።

source: Sync your tabs between devices, manage downloads, get tips about making the most of %s’s privacy protection, and more.
am: ትሮችዎን በመሳሪያዎች መካከል ያመሳስሉ፣ ውርዶችን ያስተዳድሩ፣ የ%sን ግላዊነት ጥበቃን የበለጠ ስለመጠቀም እና ሌሎችም ጠቃሚ ምክሮችን ያግኙ።

source: System auto
am: የስርዓት ራስ-ሰር

source: Tab closed
am: ትር ተዘግቷል

source: Tab count
am: የትር ብዛት

source: Tab creation tool
am: ትር መፍጠሪያ መሣሪያ

source: Tab from %s
am: ትር ከ%s

source: Tab quantity to create
am: የሚፈጠረው የትር ብዛት

source: Tab Received
am: የተቀበሉት ትር

source: Tabs
am: ትሮች

source: Tab saved!
am: ትር ተቀምጧል!

source: Tabs closed
am: ትሮች ተዘግተዋል

source: Tabs closed: %1$s
am: ትሮች ተዘግተዋል፡- %1$s

source: Tab sent!
am: ትር ተልኳል!

source: Tab settings
am: የትር ቅንብሮች

source: Tabs Open: %1$s. Tap to switch tabs.
am: ትሮች ተከፍተዋል፡- %1$s ። ትሮችን ለመቀየር መታ ያድርጉ።

source: Tabs saved!
am: ትሮች ተቀምጠዋል!

source: Tabs sent!
am: ትሮች ተልከዋል!

source: Tabs you haven’t viewed for two weeks get moved here.
am: ለሁለት ሳምንታት ያላዩዋቸው ትሮች ወደዚህ ይንቀሳቀሳሉ።

source: Tabs you haven’t viewed for two weeks get moved to the inactive section.
am: ለሁለት ሳምንታት ያላዩዋቸው ትሮች ወደ እንቅስቃሴ-አልባ ክፍል ይወሰዳሉ።

source: Tab Tools
am: የትር መሳሪያዎች

source: Tab view
am: የትር እይታ

source: Takes seconds. Change anytime.
am: ሰከንዶች ይወስዳል። በማንኛውም ጊዜ ይቀይሩ።

source: Take Survey
am: በዳሰሳ ጥናት ይሳተፉ

source: Tap and hold the arrows to jump between pages in this tab’s history.
am: በዚህ ትር ታሪክ ውስጥ ባሉ ገፆች መካከል ለመዝለል ቀስቶቹን ነካ አድርገው ይያዙ።

source: Tap here to start a fresh private session. Delete your history, cookies — everything.
am: አዲስ የግል ክፍለ ጊዜ ለመጀመር እዚህ ይንኩ። ታሪክዎን ፣ ኩኪዎችን - ሁሉንም ነገር ይሰርዙ።

source: Tap or swipe this notification to close private tabs.
am: የግል ትሮችን ለመዝጋት ይህን ማሳወቂያ ነካ ያድርጉ ወይም ያንሸራትቱ።

source: Tap to copy the URL for this app
am: የዚህን መተግበሪያ URL ለመቅዳት ይንኩ

source: Tap to open the tab that’s using your camera.
am: ካሜራዎን የሚጠቀመውን ትር ለመክፈት መታ ያድርጉ።

source: Tap to open the tab that’s using your microphone.
am: ማይክሮፎንዎን የሚጠቀመውን ትር ለመክፈት መታ ያድርጉ።

source: Tap to open the tab that’s using your microphone and camera.
am: የእርስዎን ማይክሮፎን እና ካሜራ የሚጠቀመውን ትር ለመክፈት መታ ያድርጉ።

source: Task icon
am: ተግባር አዶ

source: technical and interaction data
am: ቴክኒካዊ እና መስተጋብር ውሂብ

source: Technical and interaction data
am: ቴክኒካዊ እና መስተጋብር ውሂብ

source: Technical Data
am: የቴክኒክ ውሂብ

source: Tell websites not to share & sell data
am: ድር ጣቢያዎች ውሂብ እንዳያጋሩ እና እንዳይሸጡ ይንገሯቸው

source: Temporarily disabled
am: ለጊዜው ተሰናክሏል

source: Terms of Service
am: የአገልግሎት ውል

source: terms of use
am: የአጠቃቀም መመሪያ

source: Terms of use
am: የአጠቃቀም መመሪያ

source: Terms of Use
am: የአጠቃቀም መመሪያ

source: Text field is empty
am: የጽሑፍ መስክ ባዶ ነው

source: Thanks for reporting!
am: ሪፖርት ስላደረጉ እናመሰግናለን!

source: Thanks for your feedback!
am: ለአስተያየትዎ እናመሰግናለን!

source: The address isn’t valid
am: አድራሻው ልክ አይደለም

source: The application will quit to apply changes
am: ለውጦችን ለመተግበር መተግበርያው ያቆማል

source: The <b>adjusted rating</b> is based only on reviews we believe to be reliable.
am: የ<b>የተስተካከለ ደረጃ</b> አስተማማኝ ናቸው ብለን ባመንባቸው ግምገማዎች ላይ ብቻ የተመሰረተ ነው።

source: The connection has timed out
am: ግንኙነቱ ጊዜው አልፎበታል

source: The connection was interrupted
am: ግንኙነቱ ተቋርጧል

source: The connection was reset
am: ግንኙነቱ ዳግም ተጀምሯል

source: The developer says the extension wants to collect: %1$s
am: ገንቢው እንዳለው ይህ ቅጥያ፡- %1$sን መሰብሰብ ይፈልጋል

source: The developer says this extension collects: %1$s
am: ገንቢው እንዳለው ይህ ቅጥያ፡- %1$s ይሰበስባል

source: The developer says this extension collects: %1$s.
am: ገንቢው እንዳለው ይህ ቅጥያ፡- %1$s ይሰበስባል።

source: The developer says this extension doesn’t require data collection.
am: ገንቢው ይህ ቅጥያ የውሂብ መሰብሰብ አያስፈልገውም ብሏል።

source: The editable text field for the password.
am: ለይለፍ ቃል ሊስተካከል የሚችል የጽሑፍ መስክ።

source: The editable text field for the password of the login.
am: ለመግቢያው የይለፍ ቃል ሊስተካከል የሚችል የጽሑፍ መስክ።

source: The editable text field for the username.
am: ለተጠቃሚ ስም ሊስተካከል የሚችል የጽሑፍ መስክ።

source: The editable text field for the username of the login.
am: ለመግቢያው የተጠቃሚ ስም ሊስተካከል የሚችል የጽሑፍ መስክ።

source: The editable text field for the username of the password.
am: የይለፍ ቃል የተጠቃሚ ስም ሊስተካከል የሚችል የጽሑፍ መስክ።

source: The editable text field for the web address of the login.
am: ለመግቢያው የድር አድራሻ ሊስተካከል የሚችል የጽሑፍ መስክ።

source: The editable text field for the website address.
am: ለድር ጣቢያው አድራሻ ሊስተካከል የሚችል የጽሑፍ መስክ።

source: The editable text field for the website address of the password.
am: የይለፍ ቃል የድርጣቢያ አድራሻ ሊስተካከል የሚችል የጽሑፍ መስክ።

source: The Independent Voices collection.
am: አዲሱ ገለልተኛ የድምጾች ስብስብ።

source: The Independent Voices collection. %s
am: አዲሱ ገለልተኛ የድምጾች ስብስብ። %s

source: The logins you save or sync to %s will show up here.
am: ያስቀመጡት ወይም ከ%s ጋር ያመሳስሏቸው መግቢያዎች እዚህ ይታያሉ።

source: Theme
am: ገጽታ

source: The new Independent Voices collection.
am: አዲሱ ገለልተኛ ድምጾች ስብስብ።

source: The new Independent Voices collection. %s
am: አዲሱ ገለልተኛ ድምጾች ስብስብ። %s

source: The page at %1$s says:
am: በ%1$s ላይ ያለው ገጽ እንዲህ ይላል፡-

source: The page isn’t redirecting properly
am: ገጹ በትክክል እየተዘዋወረ አይደለም

source: The passwords you save or sync to %s will be listed here. All passwords you save are encrypted.
am: ከ%s ጋር ያስቀመጧቸው ወይም ያሰናሰሏቸው የይለፍ ቃሎች እዚህ ይዘረዘራሉ። የሚያስቀምጡት ሁሉም የይለፍ ቃሎች የተመሰጠሩ ናቸው።

source: There was a problem translating. Please try again.
am: የመተርጎም ችግር ነበር። እባክዎ እንደገና ይሞክሩ።

source: The tab counter toolbar button.
am: የትር ቆጣሪ ሰሪ-አሞሌ አዝራር።

source: This add-on could not be downloaded because of a connection failure.
am: በግንኙነት ችግር ምክንያት ይህ ተጨማሪ ሊወርድ አልቻለም።

source: This add-on could not be installed because it appears to be corrupt.
am: ይህ ተጨማሪ የተበላሸ መስሎ ስለታየ ሊጫን አልቻለም።

source: This add-on could not be installed because it has not been verified.
am: ይህ ተጨማሪ ስላልተረጋገጠ ሊጫን አልቻለም።

source: This add-on was migrated from a previous version of %1$s
am: ይህ ተጨማሪ ከቀድሞው የ%1$s ስሪት የተሸጋገረ ነው

source: This bar tucks away as you scroll down for extra browsing space.
am: ለተጨማሪ የአሰሳ ቦታ ወደ ታች ሲያሸብልሉ ይህ አሞሌ ይዘጋል።

source: This could take about 60 seconds.
am: ይህ ወደ 60 ሰከንድ ሊወስድ ይችላል።

source: This device doesn’t have enough space to download <b>%s</b>.
am: ይህ መሳሪያ <b>%s</b>ን ለማውረድ በቂ ቦታ የለውም።

source: This extension could not be downloaded because of a connection failure.
am: በግንኙነት ችግር ምክንያት ይህ ቅጥያ ሊወርድ አልቻለም።

source: This extension could not be installed because it appears to be corrupt.
am: ይህ ቅጥያ የተበላሸ ስለሚመስል መጫን አልተቻለም።

source: This extension could not be installed because it has not been verified.
am: ይህ ቅጥያ ስላልተረጋገጠ ሊጫን አልቻለም።

source: This extension doesn’t require any permissions.
am: ይህ ቅጥያ ምንም ፈቃዶችን አይፈልግም።

source: This extension is blocked for violating Mozilla’s policies and has been disabled.
am: ይህ ቅጥያ የMozilla መመሪያዎችን ስለጣሰ ታግዷል እና ተሰናክሏል።

source: This extension is restricted for violating Mozilla’s policies and has been disabled. You can enable it, but this may be risky.
am: ይህ ቅጥያ የMozilla መመሪያዎችን በመጣሱ የተከለከለ ነው እና ተሰናክሏል። እሱን ማንቃት ይችላሉ፣ ግን ይህ አደገኛ ሊሆን ይችላል።

source: This extension violates Mozilla’s policies and has been disabled. You can enable it, but this may be risky.
am: ይህ ቅጥያ የMozilla መመሪያዎችን ይጥሳል እና ተሰናክሏል። እሱን ማንቃት ይችላሉ፣ ግን ይህ አደገኛ ሊሆን ይችላል።

source: This extension violates Mozilla’s policies. Using it may be risky.
am: ይህ ቅጥያ የMozilla መመሪያዎችን ይጥሳል። እሱን መጠቀም አደገኛ ሊሆን ይችላል።

source: This helps Mozilla to estimate active users.
am: ይህ ሞዚላ ንቁ ተጠቃሚዎችን ለመገመት ይረዳል።

source: This helps us diagnose and fix issues with the browser. Reports may include personal or sensitive data.
am: ይህ በአሳሹ ላይ ችግሮችን እንድንመረምር እና እንድናስተካክል ይረዳናል። ሀተታዎች ግላዊ ወይም ሚስጥራዊ መረጃዎችን ሊያካትቱ ይችላሉ።

source: This is sample text. It is here to show how text will appear when you increase or decrease the size with this setting.
am: ይህ ናሙና ጽሑፍ ነው። በዚህ ቅንብር መጠን ሲጨምሩ ወይም ሲቀንሱ ጽሁፍ እንዴት እንደሚታይ ለማሳየት እዚህ ነው።

source: This page is stored on your device.
am: ይህ ገጽ በመሣሪያዎ ላይ ተከማችቷል።

source: This site is currently not supported by Cookie Banner Reduction. Would you like our team to review this website and add support in the future?
am: ይህ ጣቢያ በአሁኑ ጊዜ በኩኪ ሰሌዳ ቅነሳ አይደገፍም። ቡድናችን ይህንን ድህረ ገጽ እንዲገመግም እና ወደፊት ድጋፍ እንዲጨምር ይፈልጋሉ?

source: This time search:
am: በዚህ ጊዜ ፍለጋ፡-

source: This time search in:
am: በዚህ ጊዜ ፍለጋ በ፡-

source: This website requires a secure connection.
am: ይህ ድረ-ገፅ ደህንነቱ የተጠበቀ ግንኙነት ይፈልጋል።

source: Thought-provoking stories
am: አነቃቂ ታሪኮች

source: Time range to delete
am: የሚሰረዝበት ጊዜ

source: To add a new shortcut, remove one. Touch and hold the site and select remove.
am: አዲስ አቋራጭ ለመጨመር አንዱን ያስወግዱ። ድረ-ገፁን ነክተው ይያዙ እና አስወግድ የሚለውን ይምረጡ።

source: To add a new site: Visit it and select “Never translate this site” from the translation menu.
am: አዲስ ጣቢያ ለመጨመር፡ ይጎብኙት እና ከትርጉም ሜኑ ውስጥ “ይህን ጣቢያ በጭራሽ አትተርጉም” የሚለውን ይምረጡ።

source: To allow it:
am: ለመፍቀድ:-

source: Today and yesterday
am: ዛሬ እና ትናንት

source: To exit fullscreen, drag from top and press back
am: ከሙሉ ስክሪን ለመውጣት ከላይ ጎትት እና ወደኋላ ተመለስን ተጫን

source: To exit fullscreen, drag from top and use back gesture
am: ከሙሉ ስክሪን ለመውጣት ከላይ ይጎትቱ እና ወደኋላ የእጅ ምልክትን ይጠቀሙ

source: To help improve the browser, Firefox sends diagnostic and interaction data to Mozilla. %1$s
am: አሳሹን ለማሻሻል እንዲረዳ Firefox የምርመራ እና የመስተጋብር ውሂብ ወደ ሞዚላ ይልካል። %1$s
